Catalogs/Тесты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Catalog>
		<Properties>
			<Name>Тесты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.Предметы</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Предметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Язык</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Языки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьТестирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремешиватьВопросы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОцениватьРезультат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СквозныеОтветы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПеремещения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Тесты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВопросыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ВопросФорма = ПолучитьФорму("Справочник.Вопросы.ФормаОбъекта", Новый Структура("Ключ", Элемент.ТекущиеДанные.Вопрос), ЭтаФорма);
	Если ТипЗнч(ВопросФорма) = Тип("УправляемаяФорма") Тогда
		ВопросФорма.Открыть();
	КонецЕсли;
КонецПроцедуры

Процедура ВопросыЗагрузить()
	Вопросы.Загрузить(Тесты.ВопросыЗаполнить(Объект.Ссылка));
КонецПроцедуры

Процедура ОценкиЗагрузить()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Оценки.Ссылка КАК Оценка,
	                      |	Оценки.Результат КАК Результат
	                      |ИЗ
	                      |	Справочник.Оценки КАК Оценки
	                      |ГДЕ
	                      |	Оценки.Владелец = &Владелец
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Результат");
	Запрос.УстановитьПараметр("Владелец",	Объект.Ссылка);
	Оценки.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() И Объект.Предмет.Пустая() Тогда
		Объект.Предмет = Объект.Родитель.Предмет;
	ИначеЕсли НЕ Объект.Ссылка.Пустая() Тогда
		//ПриИзмененииНаСервере();
		ВопросыЗагрузить();
		ОценкиЗагрузить();
	КонецЕсли;
	Если Юзеры.УчетнаяЗаписьГостевая() Тогда
		ТолькоПросмотр = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ПриИзмененииНаСервере();
	КонецЕсли;
	Если Элементы.ПродолжительностьТестирования.Доступность Тогда
		Элементы.ПродолжительностьТестирования.СписокВыбора.Добавить(30);
		Элементы.ПродолжительностьТестирования.СписокВыбора.Добавить(60);
		Элементы.ПродолжительностьТестирования.СписокВыбора.Добавить(120);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Сначала сохраните тест", Отказ);
	////ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Предмет) Тогда
	////	ОбщегоНазначения.СообщитьОбОшибке("Укажите предмет", Отказ);
	ИначеЕсли Копирование Тогда
		Элемент.ТекущиеДанные.Код = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Форма = Неопределено;
	Если Копирование Тогда
		Форма = ПолучитьФорму("Справочник.Вопросы.ФормаОбъекта", Новый Структура("ЗначениеКопирования", Элемент.ТекущиеДанные.Вопрос), ЭтаФорма);
	ИначеЕсли НоваяСтрока Или НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Вопрос) Тогда
		Форма = ПолучитьФорму("Справочник.Вопросы.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", Новый Структура("Владелец", Объект.Ссылка)), ЭтаФорма);
	Иначе
		Форма = ПолучитьФорму("Справочник.Вопросы.ФормаОбъекта", Новый Структура("Ключ", Элемент.ТекущиеДанные.Вопрос), ЭтаФорма);
	КонецЕсли;
	Если ТипЗнч(Форма) = Тип("УправляемаяФорма") Тогда
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "Вопросы" И (Параметр = Объект.Ссылка Или ТипЗнч(Параметр) = ТипЗнч(Объект.Ссылка) И НЕ ЗначениеЗаполнено(Параметр)) Тогда
		ВопросыЗагрузить();
	ИначеЕсли ИмяСобытия = "Оценки" И (Параметр = Объект.Ссылка Или ТипЗнч(Параметр) = ТипЗнч(Объект.Ссылка) И НЕ ЗначениеЗаполнено(Параметр)) Тогда
		ВопросыЗагрузить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросыВопросыПриИзменении(Элемент)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ВопросыПередУдалением(Элемент, Отказ)
	Тесты.ВопросУдалить(Элемент.ТекущиеДанные.Вопрос, Отказ);
	Если НЕ Отказ Тогда
		ВопросыЗагрузить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросыВопросыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВопросыВопросыНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВопросыВопросыОчистка(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВопросыВопросыРегулирование(Элемент, Направление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ВопросыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ВопросыЗагрузить();
КонецПроцедуры

&НаКлиенте
Процедура ПеремешиватьВопросыПриИзменении(Элемент)
	ПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОценкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Сначала сохраните тест", Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОценкиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Форма = Неопределено;
	Если Копирование Тогда
		Форма = ПолучитьФорму("Справочник.Оценки.ФормаОбъекта", Новый Структура("ЗначениеКопирования", Элемент.ТекущиеДанные.Оценка), ЭтаФорма);
	ИначеЕсли НоваяСтрока Или НЕ ЗначениеЗаполнено(Элемент.ТекущиеДанные.Оценка) Тогда
		Форма = ПолучитьФорму("Справочник.Оценки.ФормаОбъекта", Новый Структура("ЗначенияЗаполнения", Новый Структура("Владелец", Объект.Ссылка)), ЭтаФорма);
	Иначе
		Форма = ПолучитьФорму("Справочник.Оценки.ФормаОбъекта", Новый Структура("Ключ", Элемент.ТекущиеДанные.Оценка), ЭтаФорма);
	КонецЕсли;
	Если ТипЗнч(Форма) = Тип("УправляемаяФорма") Тогда
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОценкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ОценкиЗагрузить();
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииНаСервере()
	//Элементы.ГруппаВопросы.Доступность		= НЕ Объект.СквозныеОтветы;
	//Элементы.Вопросы.Доступность			= НЕ Объект.СквозныеОтветы;
	//Элементы.Вопросы.ИзменятьПорядокСтрок	= НЕ Объект.ПеремешиватьВопросы;
	Если НЕ Юзеры.УчетнаяЗаписьГостевая() Тогда
		Элементы.ОцениватьРезультат.Доступность	= (Оценки.Количество() = 0);
		Элементы.ГруппаОценки.Доступность		= Объект.ОцениватьРезультат;
		Элементы.Оценки.Доступность				= Объект.ОцениватьРезультат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СквозныеОтветыПриИзменении(Элемент)
	ПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОцениватьРезультатПриИзменении(Элемент)
	ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПеренумероватьВопросыНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Вопросы.Ссылка КАК Ссылка,
	                      |	Вопросы.Код КАК Код
	                      |ИЗ
	                      |	Справочник.Вопросы КАК Вопросы
	                      |ГДЕ
	                      |	Вопросы.Владелец = &Тест
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Код");
	Запрос.УстановитьПараметр("Тест",	Объект.Ссылка);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		НомерСтроки		= 0;
		ШаластьУдалась	= Истина;
		НачатьТранзакцию();
		Пока Выборка.Следующий() Цикл
			НомерСтроки = НомерСтроки + 1;
			Если Выборка.Код <> НомерСтроки Тогда
				Объект = Выборка.Ссылка.ПолучитьОбъект();
				Объект.Код = НомерСтроки;
				Попытка
					Объект.Записать();
				Исключение
					ШаластьУдалась = Ложь;
					ОтменитьТранзакцию();
					Прервать;
				КонецПопытки;
			КонецЕсли;
		КонецЦикла;
		Если ШаластьУдалась Тогда
			ЗафиксироватьТранзакцию();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПеренумероватьВопросы(Команда)
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ПеренумероватьВопросыНаСервере();
	КонецЕсли;
КонецПроцедуры
